INSERT INTO descriptions (text)
VALUES ('VK Team — это миллион возможностей проявить себя. Мы делаем современные и быстрые интернет-сервисы, доступные каждому. На этом канале делимся опытом экосистемы VK, рассказываем о технологиях, наших образовательных проектах и жизни команды. Смотрите лекции экспертов, митапы, шоу, онлайн-курсы и подкасты: VK Tech Talks, «Oh, my code!», «Будущее, которое мы заслужили» и «Скринкасты». Подписывайтесь, чтобы быть в курсе!');

INSERT INTO statistics (community)
VALUES ('VK TEAM');

INSERT INTO statistic_data (text, statistics_id)
VALUES ('Дата регистрации: 11 мар. 2012г.', 1), ('15 357 808 просмотров', 1);
